In [1]:
import pandas as pd

In [4]:
df=pd.read_json('http://127.0.0.1:8000/api/flightdetails/?format=json')

In [5]:
df

   id     fname       fdate  ffare     fstart    fend
0   1   vistara  2023-02-01   4500  new delhi    pune
1   2  spicejet  2023-02-16   3500       Pune  London
2   3    Indigo  2023-02-22  12400       Pune  Ranchi